Revit 2026 API

# AnalyticalModelSelector Constructor

---

Creates a selector for the analytical model geometry.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AnalyticalModelSelector()
```
```vb
Public Sub New
```
```cpp
public:
AnalyticalModelSelector()
```
```fsharp
new : unit -> AnalyticalModelSelector
```

This version is useful for single-curve or single-point analytical models. Additionally, this only acts with respect to the entire curve or point.

#### Reference

AnalyticalModelSelector Class

AnalyticalModelSelector Overload

Autodesk.Revit.DB.Structure Namespace